Revit 2026 API
ShapeImporter Class
 A utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeImporter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ShapeImporter : IDisposable
Public Class ShapeImporter
	Implements IDisposable
public ref class ShapeImporter : IDisposable
type ShapeImporter =
    class
        interface IDisposable
    end
The ShapeImporter type exposes the following members.
Constructors
Name | Description
ShapeImporter |  Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Top
Properties
Name | Description
DefaultLengthUnit |  The length unit to be used if not specified when the input is a unitless SAT file.
InputFormat |  The format of the incoming data.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Convert |  Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose | Releases all resources used by the ShapeImporter
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsServiceAvailable |  Checks whether the data conversion service and Material Library are available.
SetDefaultLengthUnit |  Sets the length unit to be used when the input is a unitless SAT file.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See ShapeImporterSourceFormat for the list of supported formats.
See Also
Reference
Autodesk.Revit.DB Namespace